{
  "fieldsData": [
    {
      "0": "initData",
      "1": "String",
      "2": "A string with raw data transferred to the Web App, convenient for <a href=\"https://core.telegram.org/bots/webapps#validating-data-received-via-the-web-app\">validating data</a>.<br><strong>WARNING:</strong> <a href=\"https://core.telegram.org/bots/webapps#validating-data-received-via-the-web-app\">Validate data</a> from this field before using it on the bot&#39;s server."
    },
    {
      "0": "initDataUnsafe",
      "1": "<a href=\"https://core.telegram.org/bots/webapps#webappinitdata\">WebAppInitData</a>",
      "2": "An object with input data transferred to the Web App.<br><strong>WARNING:</strong> Data from this field should not be trusted. You should only use data from <em>initData</em> on the bot&#39;s server and only after it has been <a href=\"https://core.telegram.org/bots/webapps#validating-data-received-via-the-web-app\">validated</a>."
    },
    {
      "0": "version",
      "1": "String",
      "2": "The version of the Bot API available in the user&#39;s Telegram app."
    },
    {
      "0": "platform <sup><mark>NEW</mark></sup>",
      "1": "String",
      "2": "The name of the platform of the user&#39;s Telegram app."
    },
    {
      "0": "colorScheme",
      "1": "String",
      "2": "The color scheme currently used in the Telegram app. Either “light” or “dark”.<br>Also available as the CSS variable <code>var(--tg-color-scheme)</code>."
    },
    {
      "0": "themeParams",
      "1": "<a href=\"https://core.telegram.org/bots/webapps#themeparams\">ThemeParams</a>",
      "2": "An object containing the current theme settings used in the Telegram app."
    },
    {
      "0": "isExpanded",
      "1": "Boolean",
      "2": "<em>True</em>, if the Web App is expanded to the maximum available height. False, if the Web App occupies part of the screen and can be expanded to the full height using the <strong>expand()</strong> method."
    },
    {
      "0": "viewportHeight",
      "1": "Float",
      "2": "The current height of the visible area of the Web App. Also available in CSS as the variable <code>var(--tg-viewport-height)</code>.<br><br>The application can display just the top part of the Web App, with its lower part remaining outside the screen area. From this position, the user can “pull” the Web App to its maximum height, while the bot can do the same by calling the <strong>expand()</strong> method. As the position of the Web App changes, the current height value of the visible area will be updated in real time.<br><br>Please note that the refresh rate of this value is not sufficient to smoothly follow the lower border of the window. It should not be used to pin interface elements to the bottom of the visible area. It&#39;s more appropriate to use the value of the <code>viewportStableHeight</code> field for this purpose."
    },
    {
      "0": "viewportStableHeight",
      "1": "Float",
      "2": "The height of the visible area of the Web App in its last stable state. Also available in CSS as a variable <code>var(--tg-viewport-stable-height)</code>.<br><br>The application can display just the top part of the Web App, with its lower part remaining outside the screen area. From this position, the user can “pull” the Web App to its maximum height, while the bot can do the same by calling the <strong>expand()</strong> method. Unlike the value of <code>viewportHeight</code>, the value of <code>viewportStableHeight</code> does not change as the position of the Web App changes with user gestures or during animations. The value of <code>viewportStableHeight</code> will be updated after all gestures and animations are completed and the Web App reaches its final size.<br><br><em>Note the <a href=\"https://core.telegram.org/bots/webapps#events-available-for-web-apps\">event</a> <code>viewportChanged</code> with the passed parameter <code>isStateStable=true</code>, which will allow you to track when the stable state of the height of the visible area changes.</em>"
    },
    {
      "0": "headerColor",
      "1": "String",
      "2": "Current header color in the <code>#RRGGBB</code> format."
    },
    {
      "0": "backgroundColor",
      "1": "String",
      "2": "Current background color in the <code>#RRGGBB</code> format."
    },
    {
      "0": "isClosingConfirmationEnabled",
      "1": "Boolean",
      "2": "<em>True</em>, if the confirmation dialog is enabled while the user is trying to close the Web App. <em>False</em>, if the confirmation dialog is disabled."
    },
    {
      "0": "BackButton",
      "1": "<a href=\"https://core.telegram.org/bots/webapps#backbutton\">BackButton</a>",
      "2": "An object for controlling the back button which can be displayed in the header of the Web App in the Telegram interface."
    },
    {
      "0": "MainButton",
      "1": "<a href=\"https://core.telegram.org/bots/webapps#mainbutton\">MainButton</a>",
      "2": "An object for controlling the main button, which is displayed at the bottom of the Web App in the Telegram interface."
    },
    {
      "0": "HapticFeedback",
      "1": "<a href=\"https://core.telegram.org/bots/webapps#hapticfeedback\">HapticFeedback</a>",
      "2": "An object for controlling haptic feedback."
    },
    {
      "0": "isVersionAtLeast(version)",
      "1": "Function",
      "2": "Returns true if the user&#39;s app supports a version of the Bot API that is equal to or higher than the version passed as the parameter."
    },
    {
      "0": "setHeaderColor(color)",
      "1": "Function",
      "2": "<mark>Bot API 6.1+</mark> A method that sets the app header color. You can only pass <em>Telegram.WebApp.themeParams.bg_color</em> or <em>Telegram.WebApp.themeParams.secondary_bg_color</em> as a color or you can use keywords <em>bg_color</em>, <em>secondary_bg_color</em> instead."
    },
    {
      "0": "setBackgroundColor(color)",
      "1": "Function",
      "2": "<mark>Bot API 6.1+</mark> A method that sets the app background color in the <code>#RRGGBB</code> format or you can use keywords <em>bg_color</em>, <em>secondary_bg_color</em> instead."
    },
    {
      "0": "enableClosingConfirmation()",
      "1": "Function",
      "2": "<mark>Bot API 6.2+</mark> A method that enables a confirmation dialog while the user is trying to close the Web App."
    },
    {
      "0": "disableClosingConfirmation()",
      "1": "Function",
      "2": "<mark>Bot API 6.2+</mark> A method that disables the confirmation dialog while the user is trying to close the Web App."
    },
    {
      "0": "onEvent(eventType, eventHandler)",
      "1": "Function",
      "2": "A method that sets the app event handler. Check <a href=\"https://core.telegram.org/bots/webapps#events-available-for-web-apps\">the list of available events</a>."
    },
    {
      "0": "offEvent(eventType, eventHandler)",
      "1": "Function",
      "2": "A method that deletes a previously set event handler."
    },
    {
      "0": "sendData(data)",
      "1": "Function",
      "2": "A method used to send data to the bot. When this method is called, a service message is sent to the bot containing the data <em>data</em> of the length up to 4096 bytes, and the Web App is closed. See the field <em>web_app_data</em> in the class <a href=\"https://core.telegram.org/bots/api#message\">Message</a>.<br><br><em>This method is only available for Web Apps launched via a <a href=\"https://core.telegram.org/bots/webapps#keyboard-button-web-apps\">Keyboard button</a>.</em>"
    },
    {
      "0": "openLink(url[, options])",
      "1": "Function",
      "2": "A method that opens a link in an external browser. The Web App will <em>not</em> be closed.<br><mark>Bot API 6.4+</mark> If the optional <em>options</em> parameter is passed with the field <em>try_instant_view=true</em>, the link will be opened in <a href=\"https://instantview.telegram.org/\">Instant View</a> mode if possible.<br><br><em>Note that this method can be called only in response to user interaction with the Web App interface (e.g. a click inside the Web App or on the main button)</em>"
    },
    {
      "0": "openTelegramLink(url)",
      "1": "Function",
      "2": "A method that opens a telegram link inside Telegram app. The Web App <em>will</em> be closed."
    },
    {
      "0": "openInvoice(url[, callback])",
      "1": "Function",
      "2": "<mark>Bot API 6.1+</mark> A method that opens an invoice using the link <em>url</em>. The Web App will receive the <a href=\"https://core.telegram.org/bots/webapps#events-available-for-web-apps\">event</a> <em>invoiceClosed</em> when the invoice is closed. If an optional <em>callback</em> parameter was passed, the <em>callback</em> function will be called and the invoice status will be passed as the first argument."
    },
    {
      "0": "showPopup(params[, callback])",
      "1": "Function",
      "2": "<mark>Bot API 6.2+</mark> A method that shows a native popup described by the <em>params</em> argument of the type <a href=\"https://core.telegram.org/bots/webapps#popupparams\">PopupParams</a>. The Web App will receive the <a href=\"https://core.telegram.org/bots/webapps#events-available-for-web-apps\">event</a> <em>popupClosed</em> when the popup is closed. If an optional <em>callback</em> parameter was passed, the <em>callback</em> function will be called and the field <em>id</em> of the pressed button will be passed as the first argument."
    },
    {
      "0": "showAlert(message[, callback])",
      "1": "Function",
      "2": "<mark>Bot API 6.2+</mark> A method that shows <em>message</em> in a simple alert with a &#39;Close&#39; button. If an optional <em>callback</em> parameter was passed, the <em>callback</em> function will be called when the popup is closed."
    },
    {
      "0": "showConfirm(message[, callback])",
      "1": "Function",
      "2": "<mark>Bot API 6.2+</mark> A method that shows <em>message</em> in a simple confirmation window with &#39;OK&#39; and &#39;Cancel&#39; buttons. If an optional <em>callback</em> parameter was passed, the <em>callback</em> function will be called when the popup is closed and the first argument will be a boolean indicating whether the user pressed the &#39;OK&#39; button."
    },
    {
      "0": "showScanQrPopup(params[, callback]) <sup><mark>NEW</mark></sup>",
      "1": "Function",
      "2": "<mark>Bot API 6.4+</mark> A method that shows a native popup for scanning a QR code described by the <em>params</em> argument of the type <a href=\"https://core.telegram.org/bots/webapps#scanqrpopupparams\">ScanQrPopupParams</a>. The Web App will receive the <a href=\"https://core.telegram.org/bots/webapps#events-available-for-web-apps\">event</a> <em>qrTextReceived</em> every time the scanner catches a code with text data. If an optional <em>callback</em> parameter was passed, the <em>callback</em> function will be called and the text from the QR code will be passed as the first argument. Returning <em>true</em> inside this callback function causes the popup to be closed."
    },
    {
      "0": "closeScanQrPopup() <sup><mark>NEW</mark></sup>",
      "1": "Function",
      "2": "<mark>Bot API 6.4+</mark> A method that closes the native popup for scanning a QR code opened with the <em>showScanQrPopup</em> method. Run it if you received valid data in the <a href=\"https://core.telegram.org/bots/webapps#events-available-for-web-apps\">event</a> <em>qrTextReceived</em>."
    },
    {
      "0": "readTextFromClipboard([callback]) <sup><mark>NEW</mark></sup>",
      "1": "Function",
      "2": "<mark>Bot API 6.4+</mark> A method that requests text from the clipboard. The Web App will receive the <a href=\"https://core.telegram.org/bots/webapps#events-available-for-web-apps\">event</a> <em>clipboardTextReceived</em>. If an optional <em>callback</em> parameter was passed, the <em>callback</em> function will be called and the text from the clipboard will be passed as the first argument.<br><br><em>Note: this method can be called only for Web Apps launched from the attachment menu and only in response to a user interaction with the Web App interface (e.g. a click inside the Web App or on the main button).</em>"
    },
    {
      "0": "ready()",
      "1": "Function",
      "2": "A method that informs the Telegram app that the Web App is ready to be displayed.<br>It is recommended to call this method as early as possible, as soon as all essential interface elements are loaded. Once this method is called, the loading placeholder is hidden and the Web App is shown.<br>If the method is not called, the placeholder will be hidden only when the page is fully loaded."
    },
    {
      "0": "expand()",
      "1": "Function",
      "2": "A method that expands the Web App to the maximum available height. To find out if the Web App is expanded to the maximum height, refer to the value of the <em>Telegram.WebApp.isExpanded</em> parameter"
    },
    {
      "0": "close()",
      "1": "Function",
      "2": "A method that closes the Web App."
    }
  ],
  "eventsData": [
    {
      "0": "<code>themeChanged</code>",
      "1": "Occurs whenever theme settings are changed in the user&#39;s Telegram app (including switching to night mode).<br><em>eventHandler</em> receives no parameters, new theme settings and color scheme can be received via <em>this.themeParams</em> and <em>this.colorScheme</em> respectively."
    },
    {
      "0": "<code>viewportChanged</code>",
      "1": "Occurs when the visible section of the Web App is changed.<br><em>eventHandler</em> receives an object with the single field <em>isStateStable</em>. If <em>isStateStable</em> is true, the resizing of the Web App is finished. If it is false, the resizing is ongoing (the user is expanding or collapsing the Web App or an animated object is playing). The current value of the visible section’s height is available in <em>this.viewportHeight</em>."
    },
    {
      "0": "<code>mainButtonClicked</code>",
      "1": "Occurs when the <a href=\"https://core.telegram.org/bots/webapps#mainbutton\">main button</a> is pressed.<br><em>eventHandler</em> receives no parameters."
    },
    {
      "0": "<code>backButtonClicked</code>",
      "1": "<mark>Bot API 6.1+</mark> Occurrs when the <a href=\"https://core.telegram.org/bots/webapps#backbutton\">back button</a> is pressed.<br><em>eventHandler</em> receives no parameters."
    },
    {
      "0": "<code>settingsButtonClicked</code>",
      "1": "<mark>Bot API 6.1+</mark> Occurrs when the Settings item in context menu is pressed.<br><em>eventHandler</em> receives no parameters."
    },
    {
      "0": "<code>invoiceClosed</code>",
      "1": "<mark>Bot API 6.1+</mark> Occurrs when the opened invoice is closed.<br><em>eventHandler</em> receives an object with the two fields: <em>url</em> – invoice link provided and <em>status</em> – one of the invoice statuses:<br>- <strong>paid</strong> – invoice was paid successfully,<br>- <strong>cancelled</strong> – user closed this invoice without paying,<br>- <strong>failed</strong> – user tried to pay, but the payment was failed,<br>- <strong>pending</strong> – the payment is still processing. The bot will receive a service message about a <a href=\"https://core.telegram.org/bots/api#successfulpayment\">successful payment</a> when the payment is successfully paid."
    },
    {
      "0": "<code>popupClosed</code>",
      "1": "<mark>Bot API 6.2+</mark> Occurrs when the opened popup is closed.<br><em>eventHandler</em> receives an object with the single field <em>button_id</em> – the value of the field <em>id</em> of the pressed button. If no buttons were pressed, the field <em>button_id</em> will be <em>null</em>."
    },
    {
      "0": "<code>qrTextReceived</code> <sup><mark>NEW</mark></sup>",
      "1": "<mark>Bot API 6.4+</mark> Occurs when the QR code scanner catches a code with text data.<br><em>eventHandler</em> receives an object with the single field <em>data</em> containing text data from the QR code."
    },
    {
      "0": "<code>clipboardTextReceived</code> <sup><mark>NEW</mark></sup>",
      "1": "<mark>Bot API 6.4+</mark> Occurrs when the <code>readTextFromClipboard</code> method is called.<br><em>eventHandler</em> receives an object with the single field <em>data</em> containing text data from the clipboard. If the clipboard contains non-text data, the field <em>data</em> will be an empty string. If the Web App has no access to the clipboard, the field <em>data</em> will be <em>null</em>."
    }
  ]
}